БИТУправление_медицинским_центром_демо/src/ChartsOfCharacteristicTypes/ПараметрыМедицинскойКарты/ПараметрыМедицинскойКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ПараметрыМедицинскойКарты</name>
  <type>
    <types>Boolean</types>
    <types>String</types>
    <types>CatalogRef.Диагнозы</types>
    <types>CatalogRef.Сотрудники</types>
    <types>Date</types>
    <types>CatalogRef.ДополнительныеЗначенияХарактеристик</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>10</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>100</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрШаблонаОсмотра</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяПервоеЗначениеПараметраШаблона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыМедкарт</name>
    <attributes>
      <name>ТипКарты</name>
      <type>
        <types>EnumRef.ТипыМедицинскихКарт</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

БИТУправление_медицинским_центром_демо/src/ChartsOfCharacteristicTypes/ПараметрыМедицинскойКарты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ЗагрузитьПринадлежностьМедкарт();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ВыгрузитьПринадлежностьМедкарт();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПараметрШаблонаОсмотраПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ПараметрШаблонаОсмотра) Тогда
		Объект.ТипЗначения = Новый ОписаниеТипов("Строка");
	КонецЕсли;
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ВведенноеНаименование = Объект.Наименование;
	Если ЗначениеЗаполнено(ВведенноеНаименование) Тогда 
		Объект.Наименование = ОбщегоНазначенияКлиентСервер.ПривестиИмяПараметраКДопустимому(ВведенноеНаименование);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Заголовок) И ЗначениеЗаполнено(ВведенноеНаименование) Тогда
		Объект.Заголовок = ВведенноеНаименование;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьВидимостьДоступность()
	
	Если Объект.Предопределенный Тогда 
		Элементы.Наименование.ТолькоПросмотр = Истина;
		Элементы.ГруппаТипВычисляемое.ТолькоПросмотр = Истина;
		Элементы.ГруппаПараметрШаблона.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Элементы.ИспользуетсяПервоеЗначениеПараметраШаблона.Видимость = 
		ЗначениеЗаполнено(Объект.ПараметрШаблонаОсмотра);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПринадлежностьМедкарт()
	
	ТипыМедкарт.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыМедицинскойКартыТипыМедкарт.ТипКарты
	|ПОМЕСТИТЬ УстановленныеВиды
	|ИЗ
	|	ПланВидовХарактеристик.ПараметрыМедицинскойКарты.ТипыМедкарт КАК ПараметрыМедицинскойКартыТипыМедкарт
	|ГДЕ
	|	ПараметрыМедицинскойКартыТипыМедкарт.Ссылка = &Параметр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТипыМедицинскихКарт.Ссылка КАК ТипМедицинскойКарты,
	|	ВЫБОР
	|		КОГДА УстановленныеВиды.ТипКарты ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Пометка
	|ИЗ
	|	Перечисление.ТипыМедицинскихКарт КАК ТипыМедицинскихКарт
	|		ЛЕВОЕ СОЕДИНЕНИЕ УстановленныеВиды КАК УстановленныеВиды
	|		ПО ТипыМедицинскихКарт.Ссылка = УстановленныеВиды.ТипКарты";
	Запрос.УстановитьПараметр("Параметр", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТипыМедкарт.Добавить(Выборка.ТипМедицинскойКарты, , Выборка.Пометка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПринадлежностьМедкарт()
	
	Объект.ТипыМедкарт.Очистить();
	Для Каждого ЭлементВид Из ТипыМедкарт Цикл
		Если ЭлементВид.Пометка Тогда 
			Объект.ТипыМедкарт.Добавить().ТипКарты = ЭлементВид.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
